#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-2-tier-webapp/runs/run-MH2B8YJrJs7HcLqU

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
module.storage.random_id.suffix: Refreshing state... [id=wIsudA]
tls_private_key.main: Refreshing state... [id=5aba805d9992a3651f994795885f0eff3777a1ee]
local_file.private_key: Refreshing state... [id=d40be34d1d278418459eb63be9e9971757b9ea5b]
module.ec2.data.aws_ami.latest_amazon_linux: Reading...
module.vpc.aws_cloudwatch_log_group.flow_log_group: Refreshing state... [id=/aws/vpc/flow-logs-debug]
module.storage.data.aws_elb_service_account.main: Reading...
aws_key_pair.generated_key: Refreshing state... [id=project-key]
module.ec2.aws_iam_role.ec2_cloudwatch_role: Refreshing state... [id=ec2-cloudwatch-role]
module.ec2.aws_cloudwatch_log_group.app_log_group: Refreshing state... [id=/aws/ec2/webapp-logs]
module.vpc.aws_iam_role.flow_log_role: Refreshing state... [id=vpc-flow-log-role]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-05da4a2b7804164bf]
module.vpc.data.aws_caller_identity.current: Reading...
module.storage.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
module.storage.aws_s3_bucket.alb_logs: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=871308866502]
module.ec2.aws_ssm_parameter.cw_agent_config: Refreshing state... [id=AmazonCloudWatch-linux-webapp]
module.vpc.aws_iam_role_policy.flow_log_policy: Refreshing state... [id=vpc-flow-log-role:vpc-flow-log-policy]
module.ec2.aws_iam_role_policy_attachment.cw_policy: Refreshing state... [id=ec2-cloudwatch-role-20260212103025648600000001]
module.ec2.aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=ec2-cloudwatch-role-20260212103025707000000002]
module.ec2.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-cloudwatch-profile]
module.storage.aws_s3_bucket_versioning.alb_logs_versioning: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.storage.aws_s3_bucket_policy.alb_log_policy: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.storage.aws_s3_bucket_public_access_block.alb_logs_public_access_block: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.storage.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.storage.aws_s3_bucket_lifecycle_configuration.log_lifecycle: Refreshing state... [id=my-alb-debug-logs-c08b2e74]
module.ec2.data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-02b86da1e539b4dd0]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-00e9bdf70a109b206]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-07a3299ed0aae20a6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4d8a7017ed5699b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-083cc1291ca50f581]
module.vpc.aws_flow_log.vpc_debug_logs: Refreshing state... [id=fl-00c7cb7a045faf6d5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-018d10bc366dacbaf]
module.security_groups.aws_security_group.alb_sg: Refreshing state... [id=sg-06e12d2afdcf825e0]
module.alb.aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:targetgroup/app-tg20260212103037104700000004/c3aa358cc788991c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d8b001141040ba95]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-08b33045c070e376c]
module.security_groups.aws_security_group.ec2_sg: Refreshing state... [id=sg-08ff505d4398bf347]
module.alb.aws_lb.application_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:loadbalancer/app/webapp-2-tier-alb/6be9d6b8e9d3dbb4]
module.vpc.aws_route_table_association.public_assoc[1]: Refreshing state... [id=rtbassoc-05c5424fdc7d49022]
module.vpc.aws_route_table_association.public_assoc[0]: Refreshing state... [id=rtbassoc-01f4d43508f097aa7]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=main-rds-subnet-group]
module.security_groups.aws_security_group.rds_sg: Refreshing state... [id=sg-064570d1e4b216720]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:listener/app/webapp-2-tier-alb/6be9d6b8e9d3dbb4/d754b738d2e4a1a7]
module.rds.aws_db_instance.mysql: Refreshing state... [id=db-KAFTB54W4WY5GRLEUAENAUSPSA]
module.ec2.aws_launch_template.app_lt: Refreshing state... [id=lt-059c3bf492a0818fd]
module.ec2.aws_autoscaling_group.app_asg: Refreshing state... [id=webapp-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./project-key.pem"
      + id                   = (known after apply)
    }

  # module.ec2.data.aws_instances.asg_instances will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_instances" "asg_instances" {
      + id                   = (known after apply)
      + ids                  = (known after apply)
      + instance_state_names = [
          + "running",
        ]
      + instance_tags        = (known after apply)
      + ipv6_addresses       = (known after apply)
      + private_ips          = (known after apply)
      + public_ips           = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ASG-Web-Server",
            ]
        }
    }

  # module.ec2.aws_autoscaling_group.app_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "app_asg" {
        id                               = "webapp-asg"
        name                             = "webapp-asg"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-059c3bf492a0818fd"
            name    = "webapp-launch-template-20260212103831922200000007"
          ~ version = "2" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.ec2.aws_launch_template.app_lt will be updated in-place
  ~ resource "aws_launch_template" "app_lt" {
        id                                   = "lt-059c3bf492a0818fd"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "webapp-launch-template-20260212103831922200000007"
        tags                                 = {}
      ~ user_data                            = (sensitive value)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_ids     = [] -> (known after apply)
  ~ ec2_public_ips       = [] -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 3 of 9 estimated
           $34.4888000000000016/mo +$0.0

```

</details>